the-other-mariana/star-network/examples/simple_central_LP_CC2652RB_tirtos_ccs/Release/configPkg/package/cfg/simple_central_app_pem4f.c
/* Module__diagsIncluded__C */
#pragma DATA_SECTION(ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__diagsIncluded__C, ".const:ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__diagsIncluded__C");
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__diagsIncluded ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__diagsIncluded__C = (xdc_Bits32)0x90U;

/* Module__diagsMask__C */
#pragma DATA_SECTION(ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__diagsMask__C, ".const:ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__diagsMask__C");
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__diagsMask ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__diagsMask__C = ((const CT__ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__diagsMask)NULL);

/* Module__gateObj__C */
#pragma DATA_SECTION(ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__gateObj__C, ".const:ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__gateObj__C");
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__gateObj ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__gateObj__C = ((const CT__ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__gateObj)NULL);

/* Module__gatePrms__C */
#pragma DATA_SECTION(ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__gatePrms__C, ".const:ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__gatePrms__C");
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__gatePrms ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__gatePrms__C = ((const CT__ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__gatePrms)NULL);

/* Module__id__C */
#pragma DATA_SECTION(ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__id__C, ".const:ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__id__C");
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__id ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__id__C = (xdc_Bits16)0x18U;

/* Module__loggerDefined__C */
#pragma DATA_SECTION(ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerDefined__C, ".const:ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerDefined__C");
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerDefined ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerDefined__C = 0;

/* Module__loggerObj__C */
#pragma DATA_SECTION(ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerObj__C, ".const:ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerObj__C");
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerObj ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerObj__C = ((const CT__ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerObj)NULL);

/* Module__loggerFxn0__C */
#pragma DATA_SECTION(ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerFxn0__C, ".const:ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerFxn0__C");
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerFxn0 ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerFxn0__C = ((const CT__ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerFxn0)NULL);

/* Module__loggerFxn1__C */
#pragma DATA_SECTION(ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerFxn1__C, ".const:ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerFxn1__C");
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerFxn1 ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerFxn1__C = ((const CT__ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerFxn1)NULL);

/* Module__loggerFxn2__C */
#pragma DATA_SECTION(ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerFxn2__C, ".const:ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerFxn2__C");
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerFxn2 ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerFxn2__C = ((const CT__ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerFxn2)NULL);

/* Module__loggerFxn4__C */
#pragma DATA_SECTION(ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerFxn4__C, ".const:ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerFxn4__C");
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerFxn4 ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerFxn4__C = ((const CT__ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerFxn4)NULL);

/* Module__loggerFxn8__C */
#pragma DATA_SECTION(ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerFxn8__C, ".const:ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerFxn8__C");
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerFxn8 ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerFxn8__C = ((const CT__ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerFxn8)NULL);

/* Object__count__C */
#pragma DATA_SECTION(ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Object__count__C, ".const:ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Object__count__C");
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Object__count ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Object__count__C = 0;

/* Object__heap__C */
#pragma DATA_SECTION(ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Object__heap__C, ".const:ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Object__heap__C");
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Object__heap ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Object__heap__C = NULL;

/* Object__sizeof__C */
#pragma DATA_SECTION(ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Object__sizeof__C, ".const:ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Object__sizeof__C");
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Object__sizeof ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Object__sizeof__C = 0;

/* Object__table__C */
#pragma DATA_SECTION(ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Object__table__C, ".const:ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Object__table__C");
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Object__table ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Object__table__C = NULL;

/* REVISION__C */
#pragma DATA_SECTION(ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_REVISION__C, ".const:ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_REVISION__C");
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_REVISION ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_REVISION__C = (xdc_UInt32)0x11141955U;


