the-other-mariana/star-network/examples/simple_central_LP_CC2652RB_tirtos_ccs/Release/configPkg/package/cfg/simple_central_app_pem4f.c
const xdc_SizeT xdc_runtime_Error_policy__C_offset = offsetof(CT__constStruct, xdc_runtime_Error_policy__R);
const xdc_SizeT xdc_runtime_IModule_Interface__BASE__C_offset = offsetof(CT__constStruct, xdc_runtime_IModule_Interface__BASE__R);
const xdc_SizeT xdc_runtime_Startup_lastFxns__C_offset = offsetof(CT__constStruct, xdc_runtime_Startup_lastFxns__R);
const xdc_SizeT ti_sysbios_knl_Event_Object__DESC__C_offset = offsetof(CT__constStruct, ti_sysbios_knl_Event_Object__DESC__R);
const xdc_SizeT ti_sysbios_family_arm_m3_Hwi_excHookFuncs__C_offset = offsetof(CT__constStruct, ti_sysbios_family_arm_m3_Hwi_excHookFuncs__R);
const xdc_SizeT ti_sysbios_gates_GateMutex_Object__DESC__C_offset = offsetof(CT__constStruct, ti_sysbios_gates_GateMutex_Object__DESC__R);
const xdc_SizeT xdc_runtime_Startup_execImpl__C_offset = offsetof(CT__constStruct, xdc_runtime_Startup_execImpl__R);
const xdc_SizeT ti_sysbios_gates_GateMutex_Instance_State_sem__O_offset = offsetof(CT__constStruct, ti_sysbios_gates_GateMutex_Instance_State_sem__O);
const xdc_SizeT ti_sysbios_heaps_HeapTrack_Module__FXNS__C_offset = offsetof(CT__constStruct, ti_sysbios_heaps_HeapTrack_Module__FXNS__R);
const xdc_SizeT ti_sysbios_knl_Swi_Object__count__C_offset = offsetof(CT__constStruct, ti_sysbios_knl_Swi_Object__count__R);
const xdc_SizeT ti_sysbios_knl_Idle_funcList__C_offset = offsetof(CT__constStruct, ti_sysbios_knl_Idle_funcList__R);
const xdc_SizeT xdc_runtime_Text_isLoaded__C_offset = offsetof(CT__constStruct, xdc_runtime_Text_isLoaded__R);
const xdc_SizeT ti_sysbios_knl_Clock_Object__DESC__C_offset = offsetof(CT__constStruct, ti_sysbios_knl_Clock_Object__DESC__R);
const xdc_SizeT ti_sysbios_knl_Task_Module__id__C_offset = offsetof(CT__constStruct, ti_sysbios_knl_Task_Module__id__R);
const xdc_SizeT ti_sysbios_knl_Mailbox_Instance_State_dataQue__O_offset = offsetof(CT__constStruct, ti_sysbios_knl_Mailbox_Instance_State_dataQue__O);
const xdc_SizeT ti_sysbios_knl_Semaphore_eventSync__C_offset = offsetof(CT__constStruct, ti_sysbios_knl_Semaphore_eventSync__R);
const xdc_SizeT ti_sysbios_gates_GateMutex_Module__FXNS__C_offset = offsetof(CT__constStruct, ti_sysbios_gates_GateMutex_Module__FXNS__R);
const xdc_SizeT ti_sysbios_knl_Task_Module_State_inactiveQ__O_offset = offsetof(CT__constStruct, ti_sysbios_knl_Task_Module_State_inactiveQ__O);
const xdc_SizeT ti_sysbios_family_arm_m3_Hwi_Module__id__C_offset = offsetof(CT__constStruct, ti_sysbios_family_arm_m3_Hwi_Module__id__R);
const xdc_SizeT ti_sysbios_family_arm_cc26xx_Timer_Module__id__C_offset = offsetof(CT__constStruct, ti_sysbios_family_arm_cc26xx_Timer_Module__id__R);
const xdc_SizeT ti_sysbios_knl_Mailbox_Object__table__C_offset = offsetof(CT__constStruct, ti_sysbios_knl_Mailbox_Object__table__R);
const xdc_SizeT ti_sysbios_family_arm_m3_Hwi_Object__table__C_offset = offsetof(CT__constStruct, ti_sysbios_family_arm_m3_Hwi_Object__table__R);
const xdc_SizeT ti_sysbios_knl_Swi_Object__DESC__C_offset = offsetof(CT__constStruct, ti_sysbios_knl_Swi_Object__DESC__R);
const xdc_SizeT xdc_runtime_Text_charCnt__C_offset = offsetof(CT__constStruct, xdc_runtime_Text_charCnt__R);
const xdc_SizeT ti_sysbios_heaps_HeapTrack_A_bufOverflow__C_offset = offsetof(CT__constStruct, ti_sysbios_heaps_HeapTrack_A_bufOverflow__R);
const xdc_SizeT ti_sysbios_heaps_HeapMem_Object__table__C_offset = offsetof(CT__constStruct, ti_sysbios_heaps_HeapMem_Object__table__R);
const xdc_SizeT ti_sysbios_family_arm_cc26xx_Timer_funcHookCH1__C_offset = offsetof(CT__constStruct, ti_sysbios_family_arm_cc26xx_Timer_funcHookCH1__R);
const xdc_SizeT xdc_runtime_Error_policyFxn__C_offset = offsetof(CT__constStruct, xdc_runtime_Error_policyFxn__R);
const xdc_SizeT ti_sysbios_family_arm_m3_Hwi_E_reserved__C_offset = offsetof(CT__constStruct, ti_sysbios_family_arm_m3_Hwi_E_reserved__R);
const xdc_SizeT ti_sysbios_heaps_HeapTrack_A_notEmpty__C_offset = offsetof(CT__constStruct, ti_sysbios_heaps_HeapTrack_A_notEmpty__R);
const xdc_SizeT xdc_runtime_Startup_firstFxns__C_offset = offsetof(CT__constStruct, xdc_runtime_Startup_firstFxns__R);
const xdc_SizeT xdc_runtime_Text_charTab__C_offset = offsetof(CT__constStruct, xdc_runtime_Text_charTab__R);
const xdc_SizeT ti_sysbios_family_arm_m3_TaskSupport_stackAlignment__C_offset = offsetof(CT__constStruct, ti_sysbios_family_arm_m3_TaskSupport_stackAlignment__R);
const xdc_SizeT ti_sysbios_family_arm_m3_Hwi_NUM_INTERRUPTS__C_offset = offsetof(CT__constStruct, ti_sysbios_family_arm_m3_Hwi_NUM_INTERRUPTS__R);
const xdc_SizeT ti_sysbios_knl_Clock_triggerClock__C_offset = offsetof(CT__constStruct, ti_sysbios_knl_Clock_triggerClock__R);
const xdc_SizeT ti_sysbios_knl_Swi_Object__table__C_offset = offsetof(CT__constStruct, ti_sysbios_knl_Swi_Object__table__R);
const xdc_SizeT xdc_runtime_Memory_Module__id__C_offset = offsetof(CT__constStruct, xdc_runtime_Memory_Module__id__R);
const xdc_SizeT ti_sysbios_knl_Swi_Module__id__C_offset = offsetof(CT__constStruct, ti_sysbios_knl_Swi_Module__id__R);
const xdc_SizeT xdc_runtime_SysCallback_flushFxn__C_offset = offsetof(CT__constStruct, xdc_runtime_SysCallback_flushFxn__R);
const xdc_SizeT ti_sysbios_heaps_HeapMem_Module__gateObj__C_offset = offsetof(CT__constStruct, ti_sysbios_heaps_HeapMem_Module__gateObj__R);
const xdc_SizeT ti_sysbios_family_arm_cc26xx_Timer_startupNeeded__C_offset = offsetof(CT__constStruct, ti_sysbios_family_arm_cc26xx_Timer_startupNeeded__R);
const xdc_SizeT ti_sysbios_family_arm_m3_Hwi_E_noIsr__C_offset = offsetof(CT__constStruct, ti_sysbios_family_arm_m3_Hwi_E_noIsr__R);
const xdc_SizeT ti_sysbios_knl_Queue_Object__DESC__C_offset = offsetof(CT__constStruct, ti_sysbios_knl_Queue_Object__DESC__R);
const xdc_SizeT ti_sysbios_family_arm_cc26xx_Timer_funcHookCH2__C_offset = offsetof(CT__constStruct, ti_sysbios_family_arm_cc26xx_Timer_funcHookCH2__R);
const xdc_SizeT ti_sysbios_family_arm_m3_Hwi_E_NMI__C_offset = offsetof(CT__constStruct, ti_sysbios_family_arm_m3_Hwi_E_NMI__R);
const xdc_SizeT ti_sysbios_knl_Task_Object__DESC__C_offset = offsetof(CT__constStruct, ti_sysbios_knl_Task_Object__DESC__R);
const xdc_SizeT xdc_runtime_Assert_E_assertFailed__C_offset = offsetof(CT__constStruct, xdc_runtime_Assert_E_assertFailed__R);
const xdc_SizeT ti_sysbios_gates_GateHwi_Module__id__C_offset = offsetof(CT__constStruct, ti_sysbios_gates_GateHwi_Module__id__R);
const xdc_SizeT xdc_runtime_IHeap_Interface__BASE__C_offset = offsetof(CT__constStruct, xdc_runtime_IHeap_Interface__BASE__R);
const xdc_SizeT xdc_runtime_SysCallback_exitFxn__C_offset = offsetof(CT__constStruct, xdc_runtime_SysCallback_exitFxn__R);
const xdc_SizeT ti_sysbios_heaps_HeapMem_Module__id__C_offset = offsetof(CT__constStruct, ti_sysbios_heaps_HeapMem_Module__id__R);
const xdc_SizeT ti_sysbios_family_arm_m3_Hwi_excHandlerFunc__C_offset = offsetof(CT__constStruct, ti_sysbios_family_arm_m3_Hwi_excHandlerFunc__R);
const xdc_SizeT ti_sysbios_heaps_HeapMem_Module__FXNS__C_offset = offsetof(CT__constStruct, ti_sysbios_heaps_HeapMem_Module__FXNS__R);
const xdc_SizeT ti_sysbios_family_arm_m3_Hwi_E_busFault__C_offset = offsetof(CT__constStruct, ti_sysbios_family_arm_m3_Hwi_E_busFault__R);
const xdc_SizeT xdc_runtime_System_maxAtexitHandlers__C_offset = offsetof(CT__constStruct, xdc_runtime_System_maxAtexitHandlers__R);
const xdc_SizeT ti_sysbios_knl_Queue_Object__count__C_offset = offsetof(CT__constStruct, ti_sysbios_knl_Queue_Object__count__R);
const xdc_SizeT xdc_runtime_Text_registryModsLastId__C_offset = offsetof(CT__constStruct, xdc_runtime_Text_registryModsLastId__R);
const xdc_SizeT ti_sysbios_knl_Task_Object__table__C_offset = offsetof(CT__constStruct, ti_sysbios_knl_Task_Object__table__R);
const xdc_SizeT ti_sysbios_knl_Mailbox_Object__DESC__C_offset = offsetof(CT__constStruct, ti_sysbios_knl_Mailbox_Object__DESC__R);
const xdc_SizeT ti_sysbios_family_arm_m3_Hwi_nullIsrFunc__C_offset = offsetof(CT__constStruct, ti_sysbios_family_arm_m3_Hwi_nullIsrFunc__R);
const xdc_SizeT ti_sysbios_knl_Clock_tickMode__C_offset = offsetof(CT__constStruct, ti_sysbios_knl_Clock_tickMode__R);
const xdc_SizeT ti_sysbios_gates_GateMutex_Module__id__C_offset = offsetof(CT__constStruct, ti_sysbios_gates_GateMutex_Module__id__R);
const xdc_SizeT ti_sysbios_knl_Swi_numPriorities__C_offset = offsetof(CT__constStruct, ti_sysbios_knl_Swi_numPriorities__R);
const xdc_SizeT ti_sysbios_knl_Task_numConstructedTasks__C_offset = offsetof(CT__constStruct, ti_sysbios_knl_Task_numConstructedTasks__R);
const xdc_SizeT xdc_runtime_Startup_maxPasses__C_offset = offsetof(CT__constStruct, xdc_runtime_Startup_maxPasses__R);
const xdc_SizeT ti_sysbios_knl_Task_initStackFlag__C_offset = offsetof(CT__constStruct, ti_sysbios_knl_Task_initStackFlag__R);
const xdc_SizeT xdc_runtime_System_abortFxn__C_offset = offsetof(CT__constStruct, xdc_runtime_System_abortFxn__R);
const xdc_SizeT ti_sysbios_knl_Mailbox_Instance_State_dataSem__O_offset = offsetof(CT__constStruct, ti_sysbios_knl_Mailbox_Instance_State_dataSem__O);
const xdc_SizeT ti_sysbios_gates_GateHwi_Module__FXNS__C_offset = offsetof(CT__constStruct, ti_sysbios_gates_GateHwi_Module__FXNS__R);
const xdc_SizeT ti_sysbios_hal_Hwi_Object__DESC__C_offset = offsetof(CT__constStruct, ti_sysbios_hal_Hwi_Object__DESC__R);
const xdc_SizeT ti_sysbios_family_arm_m3_Hwi_priGroup__C_offset = offsetof(CT__constStruct, ti_sysbios_family_arm_m3_Hwi_priGroup__R);
const xdc_SizeT xdc_runtime_Error_E_memory__C_offset = offsetof(CT__constStruct, xdc_runtime_Error_E_memory__R);
const xdc_SizeT ti_sysbios_family_arm_m3_Hwi_E_alreadyDefined__C_offset = offsetof(CT__constStruct, ti_sysbios_family_arm_m3_Hwi_E_alreadyDefined__R);
const xdc_SizeT ti_sysbios_knl_Mailbox_Instance_State_freeSem__O_offset = offsetof(CT__constStruct, ti_sysbios_knl_Mailbox_Instance_State_freeSem__O);
const xdc_SizeT ti_sysbios_knl_Queue_Object__table__C_offset = offsetof(CT__constStruct, ti_sysbios_knl_Queue_Object__table__R);
const xdc_SizeT ti_sysbios_knl_Semaphore_eventPost__C_offset = offsetof(CT__constStruct, ti_sysbios_knl_Semaphore_eventPost__R);
const xdc_SizeT xdc_runtime_System_exitFxn__C_offset = offsetof(CT__constStruct, xdc_runtime_System_exitFxn__R);
const xdc_SizeT ti_sysbios_heaps_HeapTrack_A_doubleFree__C_offset = offsetof(CT__constStruct, ti_sysbios_heaps_HeapTrack_A_doubleFree__R);
const xdc_SizeT ti_sysbios_heaps_HeapMem_reqAlign__C_offset = offsetof(CT__constStruct, ti_sysbios_heaps_HeapMem_reqAlign__R);
const xdc_SizeT xdc_runtime_Startup_sfxnRts__C_offset = offsetof(CT__constStruct, xdc_runtime_Startup_sfxnRts__R);
const xdc_SizeT ti_sysbios_knl_Semaphore_Object__DESC__C_offset = offsetof(CT__constStruct, ti_sysbios_knl_Semaphore_Object__DESC__R);
const xdc_SizeT ti_sysbios_gates_GateHwi_Object__DESC__C_offset = offsetof(CT__constStruct, ti_sysbios_gates_GateHwi_Object__DESC__R);
const xdc_SizeT xdc_runtime_SysCallback_putchFxn__C_offset = offsetof(CT__constStruct, xdc_runtime_SysCallback_putchFxn__R);
const xdc_SizeT ti_sysbios_heaps_HeapMem_Object__count__C_offset = offsetof(CT__constStruct, ti_sysbios_heaps_HeapMem_Object__count__R);
const xdc_SizeT ti_sysbios_family_arm_m3_Hwi_numSparseInterrupts__C_offset = offsetof(CT__constStruct, ti_sysbios_family_arm_m3_Hwi_numSparseInterrupts__R);
const xdc_SizeT ti_sysbios_knl_Mailbox_maxTypeAlign__C_offset = offsetof(CT__constStruct, ti_sysbios_knl_Mailbox_maxTypeAlign__R);
const xdc_SizeT ti_sysbios_family_arm_cc26xx_TimestampProvider_useClockTimer__C_offset = offsetof(CT__constStruct, ti_sysbios_family_arm_cc26xx_TimestampProvider_useClockTimer__R);
const xdc_SizeT ti_sysbios_knl_Event_Instance_State_pendQ__O_offset = offsetof(CT__constStruct, ti_sysbios_knl_Event_Instance_State_pendQ__O);
const xdc_SizeT ti_sysbios_knl_Task_allBlockedFunc__C_offset = offsetof(CT__constStruct, ti_sysbios_knl_Task_allBlockedFunc__R);
const xdc_SizeT ti_sysbios_family_arm_m3_Hwi_E_hardFault__C_offset = offsetof(CT__constStruct, ti_sysbios_family_arm_m3_Hwi_E_hardFault__R);
const xdc_SizeT ti_sysbios_knl_Mailbox_Object__count__C_offset = offsetof(CT__constStruct, ti_sysbios_knl_Mailbox_Object__count__R);
const xdc_SizeT xdc_runtime_Text_nameStatic__C_offset = offsetof(CT__constStruct, xdc_runtime_Text_nameStatic__R);
const xdc_SizeT ti_sysbios_family_arm_m3_Hwi_E_debugMon__C_offset = offsetof(CT__constStruct, ti_sysbios_family_arm_m3_Hwi_E_debugMon__R);
const xdc_SizeT ti_sysbios_family_arm_m3_Hwi_E_svCall__C_offset = offsetof(CT__constStruct, ti_sysbios_family_arm_m3_Hwi_E_svCall__R);
const xdc_SizeT ti_sysbios_knl_Clock_Module_State_clockQ__O_offset = offsetof(CT__constStruct, ti_sysbios_knl_Clock_Module_State_clockQ__O);
const xdc_SizeT xdc_runtime_SysCallback_readyFxn__C_offset = offsetof(CT__constStruct, xdc_runtime_SysCallback_readyFxn__R);
const xdc_SizeT xdc_runtime_Text_unnamedModsLastId__C_offset = offsetof(CT__constStruct, xdc_runtime_Text_unnamedModsLastId__R);
const xdc_SizeT ti_sysbios_knl_Task_defaultStackSize__C_offset = offsetof(CT__constStruct, ti_sysbios_knl_Task_defaultStackSize__R);
const xdc_SizeT xdc_runtime_IGateProvider_Interface__BASE__C_offset = offsetof(CT__constStruct, xdc_runtime_IGateProvider_Interface__BASE__R);
const xdc_SizeT ti_sysbios_family_arm_m3_Hwi_E_hwiLimitExceeded__C_offset = offsetof(CT__constStruct, ti_sysbios_family_arm_m3_Hwi_E_hwiLimitExceeded__R);
const xdc_SizeT xdc_runtime_Startup_startModsFxn__C_offset = offsetof(CT__constStruct, xdc_runtime_Startup_startModsFxn__R);
const xdc_SizeT ti_sysbios_knl_Semaphore_Instance_State_pendQ__O_offset = offsetof(CT__constStruct, ti_sysbios_knl_Semaphore_Instance_State_pendQ__O);
const xdc_SizeT xdc_runtime_System_extendFxn__C_offset = offsetof(CT__constStruct, xdc_runtime_System_extendFxn__R);
const xdc_SizeT ti_sysbios_family_arm_m3_Hwi_Object__DESC__C_offset = offsetof(CT__constStruct, ti_sysbios_family_arm_m3_Hwi_Object__DESC__R);
const xdc_SizeT xdc_runtime_Text_nameEmpty__C_offset = offsetof(CT__constStruct, xdc_runtime_Text_nameEmpty__R);
const xdc_SizeT ti_sysbios_family_arm_m3_Hwi_Object__count__C_offset = offsetof(CT__constStruct, ti_sysbios_family_arm_m3_Hwi_Object__count__R);
const xdc_SizeT xdc_runtime_Text_visitRopeFxn__C_offset = offsetof(CT__constStruct, xdc_runtime_Text_visitRopeFxn__R);
const xdc_SizeT xdc_runtime_SysCallback_abortFxn__C_offset = offsetof(CT__constStruct, xdc_runtime_SysCallback_abortFxn__R);
const xdc_SizeT ti_sysbios_knl_Task_defaultStackHeap__C_offset = offsetof(CT__constStruct, ti_sysbios_knl_Task_defaultStackHeap__R);
const xdc_SizeT ti_sysbios_family_arm_m3_Hwi_E_usageFault__C_offset = offsetof(CT__constStruct, ti_sysbios_family_arm_m3_Hwi_E_usageFault__R);
const xdc_SizeT ti_sysbios_family_arm_m3_Hwi_ccr__C_offset = offsetof(CT__constStruct, ti_sysbios_family_arm_m3_Hwi_ccr__R);
const xdc_SizeT ti_sysbios_heaps_HeapTrack_Module__id__C_offset = offsetof(CT__constStruct, ti_sysbios_heaps_HeapTrack_Module__id__R);
const xdc_SizeT ti_sysbios_heaps_HeapMem_E_memory__C_offset = offsetof(CT__constStruct, ti_sysbios_heaps_HeapMem_E_memory__R);
const xdc_SizeT ti_sysbios_family_arm_m3_Hwi_E_memFault__C_offset = offsetof(CT__constStruct, ti_sysbios_family_arm_m3_Hwi_E_memFault__R);
const xdc_SizeT ti_sysbios_knl_Task_Object__count__C_offset = offsetof(CT__constStruct, ti_sysbios_knl_Task_Object__count__R);
const xdc_SizeT ti_sysbios_heaps_HeapMem_Object__DESC__C_offset = offsetof(CT__constStruct, ti_sysbios_heaps_HeapMem_Object__DESC__R);
const xdc_SizeT xdc_runtime_Text_nameUnknown__C_offset = offsetof(CT__constStruct, xdc_runtime_Text_nameUnknown__R);
const xdc_SizeT xdc_runtime_Memory_defaultHeapInstance__C_offset = offsetof(CT__constStruct, xdc_runtime_Memory_defaultHeapInstance__R);
const xdc_SizeT ti_sysbios_knl_Mailbox_Instance_State_freeQue__O_offset = offsetof(CT__constStruct, ti_sysbios_knl_Mailbox_Instance_State_freeQue__O);
const xdc_SizeT xdc_runtime_Startup_sfxnTab__C_offset = offsetof(CT__constStruct, xdc_runtime_Startup_sfxnTab__R);
const xdc_SizeT ti_sysbios_knl_Clock_Module__state__V_offset = offsetof(TROM__stateStruct, ti_sysbios_knl_Clock_Module__state__V);
const xdc_SizeT ti_sysbios_family_arm_cc26xx_TimestampProvider_Module__state__V_offset = offsetof(TROM__stateStruct, ti_sysbios_family_arm_cc26xx_TimestampProvider_Module__state__V);
const xdc_SizeT xdc_runtime_Startup_Module__state__V_offset = offsetof(TROM__stateStruct, xdc_runtime_Startup_Module__state__V);
const xdc_SizeT xdc_runtime_Registry_Module__state__V_offset = offsetof(TROM__stateStruct, xdc_runtime_Registry_Module__state__V);
const xdc_SizeT ti_sysbios_BIOS_Module__state__V_offset = offsetof(TROM__stateStruct, ti_sysbios_BIOS_Module__state__V);
const xdc_SizeT ti_sysbios_knl_Swi_Module__state__V_offset = offsetof(TROM__stateStruct, ti_sysbios_knl_Swi_Module__state__V);
const xdc_SizeT ti_sysbios_knl_Task_Module__state__V_offset = offsetof(TROM__stateStruct, ti_sysbios_knl_Task_Module__state__V);
const xdc_SizeT xdc_runtime_Memory_Module__state__V_offset = offsetof(TROM__stateStruct, xdc_runtime_Memory_Module__state__V);
const xdc_SizeT xdc_runtime_System_Module__state__V_offset = offsetof(TROM__stateStruct, xdc_runtime_System_Module__state__V);
const xdc_SizeT ti_sysbios_family_arm_m3_Hwi_Module__state__V_offset = offsetof(TROM__stateStruct, ti_sysbios_family_arm_m3_Hwi_Module__state__V);
const xdc_SizeT ti_sysbios_family_arm_cc26xx_Timer_Module__state__V_offset = offsetof(TROM__stateStruct, ti_sysbios_family_arm_cc26xx_Timer_Module__state__V);
#define xdc_runtime_Error_policy__C (ROM_constStruct.xdc_runtime_Error_policy__R)
#define xdc_runtime_IModule_Interface__BASE__C (ROM_constStruct.xdc_runtime_IModule_Interface__BASE__R)
#define xdc_runtime_Startup_lastFxns__C (ROM_constStruct.xdc_runtime_Startup_lastFxns__R)
#define ti_sysbios_knl_Event_Object__DESC__C (ROM_constStruct.ti_sysbios_knl_Event_Object__DESC__R)
#define ti_sysbios_family_arm_m3_Hwi_excHookFuncs__C (ROM_constStruct.ti_sysbios_family_arm_m3_Hwi_excHookFuncs__R)
#define ti_sysbios_gates_GateMutex_Object__DESC__C (ROM_constStruct.ti_sysbios_gates_GateMutex_Object__DESC__R)
#define xdc_runtime_Startup_execImpl__C (ROM_constStruct.xdc_runtime_Startup_execImpl__R)
#define ti_sysbios_gates_GateMutex_Instance_State_sem__O (ROM_constStruct.ti_sysbios_gates_GateMutex_Instance_State_sem__O)
#define ti_sysbios_heaps_HeapTrack_Module__FXNS__C (ROM_constStruct.ti_sysbios_heaps_HeapTrack_Module__FXNS__R)
#define ti_sysbios_knl_Swi_Object__count__C (ROM_constStruct.ti_sysbios_knl_Swi_Object__count__R)
#define ti_sysbios_knl_Idle_funcList__C (ROM_constStruct.ti_sysbios_knl_Idle_funcList__R)
#define xdc_runtime_Text_isLoaded__C (ROM_constStruct.xdc_runtime_Text_isLoaded__R)
#define ti_sysbios_knl_Clock_Object__DESC__C (ROM_constStruct.ti_sysbios_knl_Clock_Object__DESC__R)
#define ti_sysbios_knl_Task_Module__id__C (ROM_constStruct.ti_sysbios_knl_Task_Module__id__R)
#define ti_sysbios_knl_Mailbox_Instance_State_dataQue__O (ROM_constStruct.ti_sysbios_knl_Mailbox_Instance_State_dataQue__O)
#define ti_sysbios_knl_Semaphore_eventSync__C (ROM_constStruct.ti_sysbios_knl_Semaphore_eventSync__R)
#define ti_sysbios_gates_GateMutex_Module__FXNS__C (ROM_constStruct.ti_sysbios_gates_GateMutex_Module__FXNS__R)
#define ti_sysbios_knl_Task_Module_State_inactiveQ__O (ROM_constStruct.ti_sysbios_knl_Task_Module_State_inactiveQ__O)
#define ti_sysbios_family_arm_m3_Hwi_Module__id__C (ROM_constStruct.ti_sysbios_family_arm_m3_Hwi_Module__id__R)
#define ti_sysbios_family_arm_cc26xx_Timer_Module__id__C (ROM_constStruct.ti_sysbios_family_arm_cc26xx_Timer_Module__id__R)
#define ti_sysbios_knl_Mailbox_Object__table__C (ROM_constStruct.ti_sysbios_knl_Mailbox_Object__table__R)
#define ti_sysbios_family_arm_m3_Hwi_Object__table__C (ROM_constStruct.ti_sysbios_family_arm_m3_Hwi_Object__table__R)
#define ti_sysbios_knl_Swi_Object__DESC__C (ROM_constStruct.ti_sysbios_knl_Swi_Object__DESC__R)
#define xdc_runtime_Text_charCnt__C (ROM_constStruct.xdc_runtime_Text_charCnt__R)
#define ti_sysbios_heaps_HeapTrack_A_bufOverflow__C (ROM_constStruct.ti_sysbios_heaps_HeapTrack_A_bufOverflow__R)
#define ti_sysbios_heaps_HeapMem_Object__table__C (ROM_constStruct.ti_sysbios_heaps_HeapMem_Object__table__R)
#define ti_sysbios_family_arm_cc26xx_Timer_funcHookCH1__C (ROM_constStruct.ti_sysbios_family_arm_cc26xx_Timer_funcHookCH1__R)
#define xdc_runtime_Error_policyFxn__C (ROM_constStruct.xdc_runtime_Error_policyFxn__R)
#define ti_sysbios_family_arm_m3_Hwi_E_reserved__C (ROM_constStruct.ti_sysbios_family_arm_m3_Hwi_E_reserved__R)
#define ti_sysbios_heaps_HeapTrack_A_notEmpty__C (ROM_constStruct.ti_sysbios_heaps_HeapTrack_A_notEmpty__R)
#define xdc_runtime_Startup_firstFxns__C (ROM_constStruct.xdc_runtime_Startup_firstFxns__R)
#define xdc_runtime_Text_charTab__C (ROM_constStruct.xdc_runtime_Text_charTab__R)
#define ti_sysbios_family_arm_m3_TaskSupport_stackAlignment__C (ROM_constStruct.ti_sysbios_family_arm_m3_TaskSupport_stackAlignment__R)
#define ti_sysbios_family_arm_m3_Hwi_NUM_INTERRUPTS__C (ROM_constStruct.ti_sysbios_family_arm_m3_Hwi_NUM_INTERRUPTS__R)
#define ti_sysbios_knl_Clock_triggerClock__C (ROM_constStruct.ti_sysbios_knl_Clock_triggerClock__R)
#define ti_sysbios_knl_Swi_Object__table__C (ROM_constStruct.ti_sysbios_knl_Swi_Object__table__R)
#define xdc_runtime_Memory_Module__id__C (ROM_constStruct.xdc_runtime_Memory_Module__id__R)
#define ti_sysbios_knl_Swi_Module__id__C (ROM_constStruct.ti_sysbios_knl_Swi_Module__id__R)
#define xdc_runtime_SysCallback_flushFxn__C (ROM_constStruct.xdc_runtime_SysCallback_flushFxn__R)
#define ti_sysbios_heaps_HeapMem_Module__gateObj__C (ROM_constStruct.ti_sysbios_heaps_HeapMem_Module__gateObj__R)
#define ti_sysbios_family_arm_cc26xx_Timer_startupNeeded__C (ROM_constStruct.ti_sysbios_family_arm_cc26xx_Timer_startupNeeded__R)
#define ti_sysbios_family_arm_m3_Hwi_E_noIsr__C (ROM_constStruct.ti_sysbios_family_arm_m3_Hwi_E_noIsr__R)
#define ti_sysbios_knl_Queue_Object__DESC__C (ROM_constStruct.ti_sysbios_knl_Queue_Object__DESC__R)
#define ti_sysbios_family_arm_cc26xx_Timer_funcHookCH2__C (ROM_constStruct.ti_sysbios_family_arm_cc26xx_Timer_funcHookCH2__R)
#define ti_sysbios_family_arm_m3_Hwi_E_NMI__C (ROM_constStruct.ti_sysbios_family_arm_m3_Hwi_E_NMI__R)
#define ti_sysbios_knl_Task_Object__DESC__C (ROM_constStruct.ti_sysbios_knl_Task_Object__DESC__R)
#define xdc_runtime_Assert_E_assertFailed__C (ROM_constStruct.xdc_runtime_Assert_E_assertFailed__R)
#define ti_sysbios_gates_GateHwi_Module__id__C (ROM_constStruct.ti_sysbios_gates_GateHwi_Module__id__R)
#define xdc_runtime_IHeap_Interface__BASE__C (ROM_constStruct.xdc_runtime_IHeap_Interface__BASE__R)
#define xdc_runtime_SysCallback_exitFxn__C (ROM_constStruct.xdc_runtime_SysCallback_exitFxn__R)
#define ti_sysbios_heaps_HeapMem_Module__id__C (ROM_constStruct.ti_sysbios_heaps_HeapMem_Module__id__R)
#define ti_sysbios_family_arm_m3_Hwi_excHandlerFunc__C (ROM_constStruct.ti_sysbios_family_arm_m3_Hwi_excHandlerFunc__R)
#define ti_sysbios_heaps_HeapMem_Module__FXNS__C (ROM_constStruct.ti_sysbios_heaps_HeapMem_Module__FXNS__R)
#define ti_sysbios_family_arm_m3_Hwi_E_busFault__C (ROM_constStruct.ti_sysbios_family_arm_m3_Hwi_E_busFault__R)
#define xdc_runtime_System_maxAtexitHandlers__C (ROM_constStruct.xdc_runtime_System_maxAtexitHandlers__R)
#define ti_sysbios_knl_Queue_Object__count__C (ROM_constStruct.ti_sysbios_knl_Queue_Object__count__R)
#define xdc_runtime_Text_registryModsLastId__C (ROM_constStruct.xdc_runtime_Text_registryModsLastId__R)
#define ti_sysbios_knl_Task_Object__table__C (ROM_constStruct.ti_sysbios_knl_Task_Object__table__R)
#define ti_sysbios_knl_Mailbox_Object__DESC__C (ROM_constStruct.ti_sysbios_knl_Mailbox_Object__DESC__R)
#define ti_sysbios_family_arm_m3_Hwi_nullIsrFunc__C (ROM_constStruct.ti_sysbios_family_arm_m3_Hwi_nullIsrFunc__R)
#define ti_sysbios_knl_Clock_tickMode__C (ROM_constStruct.ti_sysbios_knl_Clock_tickMode__R)
#define ti_sysbios_gates_GateMutex_Module__id__C (ROM_constStruct.ti_sysbios_gates_GateMutex_Module__id__R)
