the-other-mariana/star-network/examples/simple_central_LP_CC2652RB_tirtos_ccs/Release/configPkg/package/cfg/simple_central_app_pem4f.c
/* Object__delete__S */
xdc_Void ti_sysbios_heaps_HeapCallback_Object__delete__S( xdc_Ptr instp ) 
{
    xdc_runtime_Core_deleteObject__I(&ti_sysbios_heaps_HeapCallback_Object__DESC__C, *((ti_sysbios_heaps_HeapCallback_Object**)instp), (xdc_Fxn)ti_sysbios_heaps_HeapCallback_Instance_finalize__E, xdc_runtime_Core_NOSTATE, FALSE);
    *((ti_sysbios_heaps_HeapCallback_Handle*)instp) = NULL;
}

/* delete */
void ti_sysbios_heaps_HeapCallback_delete(ti_sysbios_heaps_HeapCallback_Handle *instp)
{
    ti_sysbios_heaps_HeapCallback_Object__delete__S(instp);
}


/*
 * ======== ti.sysbios.heaps.HeapTrack SYSTEM FUNCTIONS ========
 */

/* per-module runtime symbols */
#undef Module__MID
#ifdef ti_sysbios_heaps_HeapTrack_Module__id__CR
#define Module__MID (*((CT__ti_sysbios_heaps_HeapTrack_Module__id *)(xdcRomConstPtr + ti_sysbios_heaps_HeapTrack_Module__id__C_offset)))
#else
#define Module__MID ti_sysbios_heaps_HeapTrack_Module__id__C
#endif

#undef Module__DGSINCL
#ifdef ti_sysbios_heaps_HeapTrack_Module__diagsIncluded__CR
#define Module__DGSINCL (*((CT__ti_sysbios_heaps_HeapTrack_Module__diagsIncluded *)(xdcRomConstPtr + ti_sysbios_heaps_HeapTrack_Module__diagsIncluded__C_offset)))
#else
#define Module__DGSINCL ti_sysbios_heaps_HeapTrack_Module__diagsIncluded__C
#endif

#undef Module__DGSENAB
#ifdef ti_sysbios_heaps_HeapTrack_Module__diagsEnabled__CR
#define Module__DGSENAB (*((CT__ti_sysbios_heaps_HeapTrack_Module__diagsEnabled *)(xdcRomConstPtr + ti_sysbios_heaps_HeapTrack_Module__diagsEnabled__C_offset)))
#else
#define Module__DGSENAB ti_sysbios_heaps_HeapTrack_Module__diagsEnabled__C
#endif

#undef Module__DGSMASK
#ifdef ti_sysbios_heaps_HeapTrack_Module__diagsMask__CR
#define Module__DGSMASK (*((CT__ti_sysbios_heaps_HeapTrack_Module__diagsMask *)(xdcRomConstPtr + ti_sysbios_heaps_HeapTrack_Module__diagsMask__C_offset)))
#else
#define Module__DGSMASK ti_sysbios_heaps_HeapTrack_Module__diagsMask__C
#endif

#undef Module__LOGDEF
#ifdef ti_sysbios_heaps_HeapTrack_Module__loggerDefined__CR
#define Module__LOGDEF (*((CT__ti_sysbios_heaps_HeapTrack_Module__loggerDefined *)(xdcRomConstPtr + ti_sysbios_heaps_HeapTrack_Module__loggerDefined__C_offset)))
#else
#define Module__LOGDEF ti_sysbios_heaps_HeapTrack_Module__loggerDefined__C
#endif

#undef Module__LOGOBJ
#ifdef ti_sysbios_heaps_HeapTrack_Module__loggerObj__CR
#define Module__LOGOBJ ti_sysbios_heaps_HeapTrack_Module__loggerObj__R
#define Module__LOGOBJ (*((CT__ti_sysbios_heaps_HeapTrack_Module__loggerObj *)(xdcRomConstPtr + ti_sysbios_heaps_HeapTrack_Module__loggerObj__C_offset)))
#else
#define Module__LOGOBJ ti_sysbios_heaps_HeapTrack_Module__loggerObj__C
#endif

#undef Module__LOGFXN0
#ifdef ti_sysbios_heaps_HeapTrack_Module__loggerFxn0__CR
#define Module__LOGFXN0 (*((CT__ti_sysbios_heaps_HeapTrack_Module__loggerFxn0 *)(xdcRomConstPtr + ti_sysbios_heaps_HeapTrack_Module__loggerFxn0__C_offset)))
#else
#define Module__LOGFXN0 ti_sysbios_heaps_HeapTrack_Module__loggerFxn0__C
#endif

#undef Module__LOGFXN1
#ifdef ti_sysbios_heaps_HeapTrack_Module__loggerFxn1__CR
#define Module__LOGFXN1 (*((CT__ti_sysbios_heaps_HeapTrack_Module__loggerFxn1 *)(xdcRomConstPtr + ti_sysbios_heaps_HeapTrack_Module__loggerFxn1__C_offset)))
#else
#define Module__LOGFXN1 ti_sysbios_heaps_HeapTrack_Module__loggerFxn1__C
#endif

#undef Module__LOGFXN2
#ifdef ti_sysbios_heaps_HeapTrack_Module__loggerFxn2__CR
#define Module__LOGFXN2 (*((CT__ti_sysbios_heaps_HeapTrack_Module__loggerFxn2 *)(xdcRomConstPtr + ti_sysbios_heaps_HeapTrack_Module__loggerFxn2__C_offset)))
#else
#define Module__LOGFXN2 ti_sysbios_heaps_HeapTrack_Module__loggerFxn2__C
#endif

#undef Module__LOGFXN4
#ifdef ti_sysbios_heaps_HeapTrack_Module__loggerFxn4__CR
#define Module__LOGFXN4 (*((CT__ti_sysbios_heaps_HeapTrack_Module__loggerFxn4 *)(xdcRomConstPtr + ti_sysbios_heaps_HeapTrack_Module__loggerFxn4__C_offset)))
#else
#define Module__LOGFXN4 ti_sysbios_heaps_HeapTrack_Module__loggerFxn4__C
#endif

#undef Module__LOGFXN8
#ifdef ti_sysbios_heaps_HeapTrack_Module__loggerFxn8__CR
#define Module__LOGFXN8 (*((CT__ti_sysbios_heaps_HeapTrack_Module__loggerFxn8 *)(xdcRomConstPtr + ti_sysbios_heaps_HeapTrack_Module__loggerFxn8__C_offset)))
#else
#define Module__LOGFXN8 ti_sysbios_heaps_HeapTrack_Module__loggerFxn8__C
#endif

#undef Module__G_OBJ
#ifdef ti_sysbios_heaps_HeapTrack_Module__gateObj__CR
#define Module__G_OBJ (*((CT__ti_sysbios_heaps_HeapTrack_Module__gateObj *)(xdcRomConstPtr + ti_sysbios_heaps_HeapTrack_Module__gateObj__C_offset)))
#else
#define Module__G_OBJ ti_sysbios_heaps_HeapTrack_Module__gateObj__C
#endif

#undef Module__G_PRMS
#ifdef ti_sysbios_heaps_HeapTrack_Module__gatePrms__CR
#define Module__G_PRMS (*((CT__ti_sysbios_heaps_HeapTrack_Module__gatePrms *)(xdcRomConstPtr + ti_sysbios_heaps_HeapTrack_Module__gatePrms__C_offset)))
#else
#define Module__G_PRMS ti_sysbios_heaps_HeapTrack_Module__gatePrms__C
#endif

#undef Module__GP_create
#define Module__GP_create ti_sysbios_heaps_HeapTrack_Module_GateProxy_create
#undef Module__GP_delete
#define Module__GP_delete ti_sysbios_heaps_HeapTrack_Module_GateProxy_delete
#undef Module__GP_enter
#define Module__GP_enter ti_sysbios_heaps_HeapTrack_Module_GateProxy_enter
#undef Module__GP_leave
#define Module__GP_leave ti_sysbios_heaps_HeapTrack_Module_GateProxy_leave
#undef Module__GP_query
#define Module__GP_query ti_sysbios_heaps_HeapTrack_Module_GateProxy_query

/* Module__startupDone__S */
xdc_Bool ti_sysbios_heaps_HeapTrack_Module__startupDone__S( void )
{
    return 1;
}

/* Handle__label__S */
xdc_runtime_Types_Label *ti_sysbios_heaps_HeapTrack_Handle__label__S(xdc_Ptr obj, xdc_runtime_Types_Label *lab) 
{
    lab->handle = obj;
    lab->modId = 46;
    lab->named = FALSE;
    lab->iname = xdc_runtime_Text_nameUnknown;

    return lab;
}

/* Params__init__S */
xdc_Void ti_sysbios_heaps_HeapTrack_Params__init__S( xdc_Ptr prms, const void *src, xdc_SizeT psz, xdc_SizeT isz ) 
{
    xdc_runtime_Core_assignParams__I(prms, (xdc_CPtr)(src ? src : &ti_sysbios_heaps_HeapTrack_Object__PARAMS__C), psz, isz);
}

